src/cf/InformationRegisters/вогФинансированиеКомандировок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогФинансированиеКомандировок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Финансирование</Name>
					<Type>
						<v8:Type>cfg:EnumRef.вогВидыФинансирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Командировка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.вогКомандировка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/вогФинансированиеКомандировок/Ext/ManagerModule.bsl
Процедура УстановитьФинансирование(Сотрудник, Командировка, Финансирование) Экспорт
	
	НаборЗаписей = РегистрыСведений.вогФинансированиеКомандировок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Командировка.Установить(Командировка);
	НаборЗаписей.Отбор.Сотрудник.Установить(Сотрудник);
	Запись = НаборЗаписей.Добавить();
	Запись.Командировка = Командировка;
	Запись.Сотрудник = Сотрудник;
	Запись.Финансирование = Финансирование;
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьФинансирование(Сотрудник, Командировка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вогФинансированиеКомандировок.Финансирование КАК Финансирование
		|ИЗ
		|	РегистрСведений.вогФинансированиеКомандировок КАК вогФинансированиеКомандировок
		|ГДЕ
		|	вогФинансированиеКомандировок.Командировка = &Командировка
		|	И вогФинансированиеКомандировок.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Командировка", Командировка);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() тогда
		Возврат ВыборкаДетальныеЗаписи.Финансирование;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
